; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v7 - type_1 ?v4 - type_2)
 	      (pred_4 ?v8 - object ?v4 - type_2)
	      (pred_3 ?v7 - type_1 ?v6 - type_3)
	      (pred_2 ?v7 - type_1 ?v8 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v7 - type_1 ?v3 ?v5 - type_2)
       :precondition (and  (pred_1 ?v7 ?v3))
       :effect (and  (pred_1 ?v7 ?v5)
		     (not (pred_1 ?v7 ?v3))))

   (:action op_3
       :parameters (?v7 - type_1 ?v2 - object ?v1 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v1) (pred_1 ?v7 ?v1) (pred_3 ?v7 ?v6))
       :effect (and (pred_2 ?v7 ?v2 ?v6)
		    (not (pred_4 ?v2 ?v1)) 
		    (not (pred_3 ?v7 ?v6))))

   (:action op_2
       :parameters (?v7 - type_1 ?v2 - object ?v1 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v2 ?v6) (pred_1 ?v7 ?v1))
       :effect (and (pred_4 ?v2 ?v1)
		    (pred_3 ?v7 ?v6)
		    (not (pred_2 ?v7 ?v2 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_1
obj_01 obj_07 - type_3
obj_04 obj_02 obj_05 - type_2
obj_08 obj_03 obj_06 - object)
(:init
(pred_1 obj_09 obj_02)
(pred_3 obj_09 obj_01)
(pred_3 obj_09 obj_07)
(pred_4 obj_08 obj_02)
(pred_4 obj_03 obj_02)
(pred_4 obj_06 obj_02)
)
(:goal
(and
(pred_4 obj_08 obj_02)
(pred_4 obj_03 obj_04)
(pred_4 obj_06 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_09 ?b obj_07))))
)
)

; plan
1. (op_3 obj_09 obj_03 obj_02 obj_01)
   deleted: (pred_4 obj_03 obj_02) (pred_3 obj_09 obj_01)
   added: (pred_2 obj_09 obj_03 obj_01)
   goals met: 1 of 3
2. (op_1 obj_09 obj_02 obj_04)
   deleted: (pred_1 obj_09 obj_02)
   added: (pred_1 obj_09 obj_04)
   goals met: 1 of 3
3. (op_2 obj_09 obj_03 obj_04 obj_01)
   deleted: (pred_2 obj_09 obj_03 obj_01)
   added: (pred_4 obj_03 obj_04) (pred_3 obj_09 obj_01)
   goals met: 2 of 3
4. (op_1 obj_09 obj_04 obj_02)
   deleted: (pred_1 obj_09 obj_04)
   added: (pred_1 obj_09 obj_02)
   goals met: 2 of 3
5. (op_3 obj_09 obj_06 obj_02 obj_01)
   deleted: (pred_4 obj_06 obj_02) (pred_3 obj_09 obj_01)
   added: (pred_2 obj_09 obj_06 obj_01)
   goals met: 2 of 3
6. (op_1 obj_09 obj_02 obj_04)
   deleted: (pred_1 obj_09 obj_02)
   added: (pred_1 obj_09 obj_04)
   goals met: 2 of 3
7. (op_2 obj_09 obj_06 obj_04 obj_01)
   deleted: (pred_2 obj_09 obj_06 obj_01)
   added: (pred_4 obj_06 obj_04) (pred_3 obj_09 obj_01)
   goals met: 3 of 3
